# Direction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePlane..::..Direction Property
ReferencePlane Class See Also
---
The direction of the reference plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Direction { get; set; }
```

Visual Basic
---
```text
Public Property Direction As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Direction {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
When setting this property, an exception will be thrown if the direction vector is not perpendicular to the normal vector.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: newDir has zero length. |

# See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace